In [1]:
from pandas import Series

In [2]:
series1 = Series([100, 200, 300, 400, 500])
series2 = Series([10, 20, 30, 40, 50])
series1 + series2

0    110
1    220
2    330
3    440
4    550
dtype: int64

In [3]:
from pandas import DataFrame as df

In [4]:
data = {
    'Speed' : [100, 30, 28],
    'Temperature' : [34, 23, 32]
}
df1 = df(data)

In [5]:
df1

   Speed  Temperature
0    100           34
1     30           23
2     28           32

In [6]:
data2 = {
    'Speed' : [20, 23, 54],
    'Temperature' : [28, 42, 12],
    'Humidity' : [45, 23, 92]
}
df2 = df(data2)
df2

   Humidity  Speed  Temperature
0        45     20           28
1        23     23           42
2        92     54           12

In [7]:
df1 + df2

   Humidity  Speed  Temperature
0       NaN    120           62
1       NaN     53           65
2       NaN     82           44

In [8]:
series2 = Series([50, 40, 20], index=['Speed', 'Temperature', 'Humidity'])
series2

Speed          50
Temperature    40
Humidity       20
dtype: int64

In [9]:
(df1 + df2) - series2

   Humidity  Speed  Temperature
0       NaN     70           22
1       NaN      3           25
2       NaN     32            4

In [10]:
series3 = Series([[60, 50, 32], 40, 20], index=['Speed', 'Temperature', 'Humidity'])
series3

Speed          [60, 50, 32]
Temperature              40
Humidity                 20
dtype: object

In [12]:
series4 = Series([33, 41, 24, 25, 61, 43, 29], index=[2, 1, 6, 7, 3, 5, 4])
series4

2    33
1    41
6    24
7    25
3    61
5    43
4    29
dtype: int64

In [13]:
series4.sort_index()

1    41
2    33
3    61
4    29
5    43
6    24
7    25
dtype: int64

It's pretty much the same for dataframes as well.
dataframe_name.sort_index()

In [14]:
series4.sort_values()

6    24
7    25
4    29
2    33
1    41
5    43
3    61
dtype: int64

In [16]:
df2.sort_values(by='Speed')

   Humidity  Speed  Temperature
0        45     20           28
1        23     23           42
2        92     54           12

In [17]:
series5 = Series([100, 200, 300], index=['a', 'b', 'b'])
series5

a    100
b    200
b    300
dtype: int64

In [18]:
series5.index.is_unique

False

In [20]:
df2.sum()

Humidity       160
Speed           97
Temperature     82
dtype: int64

In [21]:
df2.sum(axis=1)

0     93
1     88
2    158
dtype: int64

In [22]:
df2.idxmax()

Humidity       2
Speed          2
Temperature    1
dtype: int64

In [23]:
df2.idxmin()

Humidity       1
Speed          0
Temperature    2
dtype: int64

In [25]:
import numpy as np
series6 = Series([1, 2, 3, 4, np.nan], index=['a','b','c','d','e'])
series6

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [26]:
series6.dropna()

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [27]:
series6 = series6.dropna()

In [28]:
series6

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

Same with DataFrames

In [29]:
data4 = {
    'Name' : ['John', 'Carter', 'Mushrrom'],
    'Age' : [3, np.nan, 5],
    'Study' : ['mec','eng', 'hum']
}
data4

{'Age': [3, nan, 5],
 'Name': ['John', 'Carter', 'Mushrrom'],
 'Study': ['mec', 'eng', 'hum']}

In [30]:
df3 = df(data4)

In [31]:
df3

   Age      Name Study
0  3.0      John   mec
1  NaN    Carter   eng
2  5.0  Mushrrom   hum

In [33]:
df3.dropna()

   Age      Name Study
0  3.0      John   mec
2  5.0  Mushrrom   hum

In [34]:
df3.fillna(0)

   Age      Name Study
0  3.0      John   mec
1  0.0    Carter   eng
2  5.0  Mushrrom   hum